app/views/books/show.html.erb

          </td>
          <td>コメント数：<%= @book.book_comments.count %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]

      </table>
      <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]