app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "aaa"], ["user_id", 1], ["created_at", "2021-10-26 09:08:50.302754"], ["updated_at", "2021-10-26 09:08:50.302754"], ["book_id", 4]]
---
  def create
    book = Book.find(params[:book_id])
    comment = BookComment.new(book_comment_params)
    comment.user_id = current_user.id
    comment.book_id = book.id
    comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 4]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    BookComment.find_by(id: params[:id]).destroy